Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: In motion controller mode, the DIAG outputs deliver a position compare signal to allow exact triggering of external logic, and an interrupt signal to trigger software to certain conditions within the motion ramp.
it_it: Nella modalità "motion controller" [controller di movimento], le uscite DIAG forniscono un segnale di confronto della posizione per consentire l'attivazione esatta della logica esterna e un segnale di interruzione per attivare il software in determinate condizioni all'interno della rampa di movimento.

source: In order for the load measurement to work properly, the motor must work in microstep operation.
it_it: Affinché la misurazione del carico funzioni correttamente, il motore deve funzionare in modalità microstep.

source: In order to calculate the relationship between the pulse per time and the real world revolution per second, we click on the motion calculator.
it_it: Per calcolare la relazione tra gli impulsi al tempo e il giro al secondo reale, clicchiamo sul calcolatore di movimento.

source: In order to configure the stall guard, we need the motor to be running at a certain velocity.
it_it: Per configurare la protezione anti-stallo, è necessario che il motore giri a una certa velocità.

source: In order to detect the lowest possible reading, you should monitor the DIAG output, or use special software in order to reach to a certain threshold for the StallGuard4 reading e.g., by stopping the motor.
it_it: Per rilevare la lettura più bassa possibile, è necessario monitorare l'uscita DIAG o utilizzare un software specifico per raggiungere una determinata soglia per la lettura di StallGuard4, ad esempio arrestando il motore.

source: In order to detect the lowest possible reading, you should monitor the StallGuard output the driver IC has.
it_it: Per rilevare la lettura più bassa possibile, è necessario monitorare l'uscita di StallGuard del circuito integrato del driver.

source: In order to detect the motor load, StallGuard measures electrical energy flowing into the motor and electrical energy flowing out of the motor again.
it_it: Per rilevare il carico del motore, StallGuard misura l'energia elettrica che entra nel motore e quella che esce dal motore.

source: In order to match the motor current to a certain level, the StealthChop PWM voltage must be scaled depending on the actual motor velocity.
it_it: Per adattare la corrente del motore a un determinato livello, la tensione PWM dello StealthChop deve essere scalata in base alla velocità effettiva del motore.

source: In order to set that, click on the velocity mode.
it_it: Per impostarla, cliccare sulla modalità velocità.

source: In other words, it is triggered when the SG value is above a limit.
it_it: In altre parole, si attiva quando il valore SG è al di sopra di un limite.

source: In principle one can hold two of those coupled stepper motors on a desktop, but for higher torque stepper motors a fixing is required.
it_it: In linea di principio, è possibile tenere due di questi motori passo-passo accoppiati su un tavolo, ma per motori passo-passo con coppia più elevata è necessario un fissaggio.

source: In some applications, a velocity dependent tuning of the SGT value can be expedient, using a small number of support points and linear interpolation.
it_it: In alcune applicazioni, può essere utile una regolazione del valore di SGT in base alla velocità, utilizzando un numero ridotto di punti di supporto e un'interpolazione lineare.

source: In such cases it is recommended to change base parameters (speed, motor coil inductance, motor coil resistance).
it_it: In questi casi, si consiglia di modificare i parametri di base (velocità, induttanza della bobina del motore, resistenza della bobina del motore).

source: In such situations, when Back-EMF becomes too high and the chopping current cannot be reached any more, one can lower the CS value (current scale value) of the Trinamic driver IC to reduce the chopping current to a peak value that can still be reached within the motor coils even with high Back-EMF.
it_it: In tali situazioni, quando la forza controelettromotrice diventa troppo elevata e la corrente di chopping non può più essere raggiunta, è possibile abbassare il valore CS ("current scale value" [valore di scala della corrente]) del circuito integrato del driver Trinamic per ridurre la corrente di chopping a un valore di picco che può essere ancora raggiunto all'interno delle bobine del motore anche con una forza controelettromotrice elevata.

source: In the last packet, this bit is set to zero.
it_it: Nell'ultimo pacchetto, questo bit è impostato su zero.

source: In the moment of the step resulting in a step loss, the lowest reading will be visible.
it_it: Nel momento in cui il passo determina una perdita di passo, sarà visibile la lettura più bassa.

source: In the stall guard setting, the first variable we have is to set the stall guard to threshold.
it_it: Nell'impostazione di StallGuard, la prima variabile che abbiamo è quella di impostare lo StallGuard su soglia.

source: In this case one has to check for an increasing StallGuard2 value SG to identify situations of increased load angle and possibility of motor stall.
it_it: In questo caso è necessario verificare un aumento del valore SG di StallGuard2 per identificare situazioni di angolo di carico aumentato e possibilità di stallo del motore.

source: In this case, the driver should be reset, i.e., by switching off VCC_IO.
it_it: In questo caso il driver deve essere resettato, cioè spegnendo VCC_IO.

source: In this case, the motion controller remains unused.
it_it: In questo caso, il controller di movimento rimane inutilizzato.

source: In this demonstration, we will use 1 revolution per second as the initial velocity.
it_it: In questa dimostrazione, utilizzeremo 1 giro al secondo come velocità iniziale.

source: In this velocity range, there is not much dependence of SG_RESULT on the motor load, because the motor does not generate significant back EMF.
it_it: In questo intervallo di velocità, SG_RESULT non dipende molto dal carico del motore, poiché il motore non genera una forza controelettromotrice significativa.

source: Increase SGT if the motor becomes stopped before a stall occurs.
it_it: Aumentare SGT se il motore si ferma prima che si verifichi uno stallo.

source: Increasing the speed causes the StallGuard2 value SG to become more and more independent from speed.
it_it: L'aumento della velocità fa sì che il valore di StallGuard2 SG diventi sempre più indipendente dalla velocità.

source: Information is provided from the perspective of both the host and the decoder.
it_it: Le informazioni sono fornite sia dal punto di vista dell'host che del decoder.

source: Intermediate packets always have the continuation bit set (1).
it_it: I pacchetti intermedi hanno sempre il bit di continuazione impostato (1).

source: Intermediate packets get no response.
it_it: I pacchetti intermedi non ricevono risposta.

source: Introduction
it_it: Introduzione

source: It allows the stepper to run with its target velocity as commanded by the ramp generator as long as it can cope with the load.
it_it: Consente allo stepper di funzionare con la velocità target comandata dal generatore di rampa purché possa far fronte al carico.

source: It balances low current ripple and good higher velocity performance vs. dynamic power dissipation.
it_it: Bilancia un basso ripple di corrente e buone prestazioni ad alta velocità rispetto alla dissipazione di potenza dinamica.

source: It becomes activated whenever the StallGuard value SG_RESULT reaches zero, and at the same time the velocity condition is fulfilled (TSTEP ≤ TCOOLTHRS).
it_it: Si attiva ogni volta che il valore StallGuard SG_RESULT raggiunge lo zero e allo stesso tempo la condizione di velocità è soddisfatta (TSTEP ≤ TCOOLTHRS).

source: It can be driven by any standard UART.
it_it: Può essere pilotata da qualsiasi UART standard.

source: It can be used for stall detection as well as other uses at loads below those which stall the motor, such as CoolStep loadadaptive current reduction.
it_it: Può essere utilizzato per il rilevamento dello stallo e per altri utilizzi con carichi inferiori a quelli che causano lo stallo del motore, come la riduzione di corrente adattiva al carico CoolStep.

source: It compensates for motor specific characteristics and controls sensitivity.
it_it: Compensa le caratteristiche specifiche del motore e controlla la sensibilità.

source: It compensates for variations in motor construction, for example due to misalignment of the phase A to phase B magnets.
it_it: Compensa le variazioni nella struttura del motore, ad esempio dovute al disallineamento dei magneti di fase A e fase B.

source: It does not cover all advanced functionalities but concentrates on the basic function set to make a motor run smoothly.
it_it: Non copre tutte le funzionalità avanzate ma si concentra sulle funzioni di base impostate per far funzionare senza problemi un motore.

source: It does not use nor require any means of current measurement.
it_it: Non utilizza né richiede alcun mezzo di misurazione della corrente.

source: It guarantees absolutely quiet motor standstill and silent slow motion, except for noise generated by ball bearings.
it_it: Garantisce un arresto del motore assolutamente silenzioso e un movimento lento silenzioso, ad eccezione del rumore generato dai cuscinetti a sfera.

source: It is based on a voltage mode PWM. In case of standstill and at low velocities, the motor is noiseless.
it_it: Si basa su un PWM in tensione. In caso di arresto e a basse velocità, il motore è silenzioso.

source: It is important for CoolStep because it changes the current amplitude.
it_it: È importante per CoolStep perché modifica l'ampiezza della corrente.

source: It is intended to drive a bipolar stepper motor.
it_it: È progettato per pilotare un motore passo-passo bipolare.

source: It is similar to the SG value from StallGuard2.
it_it: È simile al valore SG di StallGuard2.

source: It is the angle between the magnetic field direction of the rotor and the magnetic field direction of the rotating magnetic field of the stator.
it_it: È l'angolo tra la direzione del campo magnetico del rotore e la direzione del campo magnetico rotante dello statore.

source: It programs the driver to SpreadCycle mode and programs the motion controller for a constant velocity move and then read accesses the position and actual velocity registers:
it_it: Programma il driver in modalità SpreadCycle e programma il motion controller per un movimento a velocità costante, quindi accede in lettura ai registri di posizione e velocità effettiva:

source: It should be set to an application specific default value.
it_it: Dovrebbe essere impostato su un valore predefinito specifico dell'applicazione.

source: It toggles with each step not taken by the sequencer.
it_it: Si attiva/disattiva con ogni passo non eseguito dal sequenziatore.

source: It uses the StallGuard2 load measurement information to adjust the motor current to the minimum amount required in the actual load situation.
it_it: Utilizza le informazioni di misurazione del carico di StallGuard2 per regolare la corrente del motore al valore minimo richiesto nella situazione di carico effettiva.

source: It uses the StealthChop voltage chopper and not SpreadCycle.
it_it: Utilizza il chopper di tensione StealthChop e non SpreadCycle.

source: It will also reset to power-up defaults in case any of the supply voltages monitored by internal reset circuitry (VSA, +5VOUT or VCC_IO) falls below the undervoltage threshold.
it_it: Ripristinerà inoltre i valori di default all'accensione nel caso in cui una qualsiasi delle tensioni di alimentazione monitorate dal circuito di reset interno (VSA, +5VOUT o VCC_IO) scenda al di sotto della soglia di sottotensione.

source: Its higher torque available at lower velocity, plus dynamic torque from its flywheel mass allows compensating for mechanical torque peaks.
it_it: La sua coppia più elevata disponibile a velocità più basse, oltre alla coppia dinamica derivante dalla massa del volano, consente di compensare i picchi di coppia meccanica.

source: Key Concepts
it_it: Concetti Chiave

source: Later, you can optimize energy saving by evaluation faster decreasing rates.
it_it: In seguito, è possibile ottimizzare il risparmio energetico valutando velocità di riduzione più rapide.

source: Length
it_it: Lunghezza

source: Length Field
it_it: Campo Lunghezza

source: Length of message (not including checksum).
it_it: Lunghezza del messaggio (checksum escluso).

source: Length of message not including the check sum bytes.
it_it: Lunghezza del messaggio, esclusi i byte del checksum.

source: Like StallGuard2, the StallGuard4 value varies with the velocity of the motor.
it_it: Come per StallGuard2, il valore di StallGuard4 varia con la velocità del motore.

source: Lists commands which decoder will perform.
it_it: Elenca i comandi che il decoder eseguirà.

source: Load Angle
it_it: Angolo di Carico

source: Load dependent speed control.
it_it: Controllo della velocità in base al carico.

source: Load-adaptive automatic current scaling based on the load measurement via StallGuard2 or StallGuard4 adapting the required current to the load.
it_it: Scaling automatico adattativo della corrente al carico basato sulla misurazione del carico tramite StallGuard2 o StallGuard4, adattando la corrente richiesta al carico.

source: Load-adaptive current control reducing energy consumption by as much as 75%.
it_it: Controllo di corrente adattivo al carico che riduce il consumo energetico fino al 75%.

source: Lower velocity threshold for switching on CoolStep and stop on stall.
it_it: Soglia di velocità inferiore per l'attivazione di CoolStep e l'arresto in stallo.

source: Make sure, that the setting works reliable in a certain range (e.g., 80% to 120% of desired velocity) and also under extreme motor conditions (lowest and highest applicable temperature).
it_it: Assicurarsi che l'impostazione funzioni in modo affidabile in un determinato intervallo (ad esempio, dall'80% al 120% della velocità desiderata) e anche in condizioni estreme del motore (temperatura minima e massima applicabile).

source: Maximum value is 0xFF.
it_it: Il valore massimo è 0xFF.

source: Meaning
it_it: Significato

source: Mechanical Load via the Difference of Micro Step Positions
it_it: Carico Meccanico Tramite la Differenza di Posizioni dei Micro-Passi

source: Message Packets
it_it: Pacchetti di Messaggi

source: Message Source
it_it: Origine del Messaggio

source: Microcontrollers which are equipped with hardware SPI are typically able to communicate using integer multiples of 8 bit.
it_it: I microcontrollori dotati di SPI hardware sono in genere in grado di comunicare utilizzando multipli interi di 8 bit.

source: Microstep interpolator for obtaining increased smoothness of microstepping when using the STEP/DIR interface.
it_it: Interpolatore microstep per ottenere una maggiore fluidità del microstepping quando si utilizza l'interfaccia STEP/DIR.

source: Monitor the StallGuard output signal via the DIAG pin output.
it_it: Monitorare il segnale di uscita di StallGuard tramite l'uscita del pin DIAG.

source: Most energy goes to thermal power dissipation in the motor coils.
it_it: La maggior parte dell'energia viene dissipata termicamente negli avvolgimenti del motore.

source: Most of the unit-to-unit variation in StallGuard2 measurements results from manufacturing tolerances in motor construction.
it_it: La maggior parte della variazione da unità a unità nelle misurazioni di StallGuard2 deriva dalle tolleranze di fabbricazione nella costruzione del motore.

source: Most of them can either be written only or read only.
it_it: La maggior parte di essi può essere di sola scrittura o di sola lettura.

source: Most registers are write-only registers, some can be read additionally, and there are also some read only registers.
it_it: La maggior parte dei registri sono di sola scrittura, alcuni possono essere letti anche in lettura e alcuni registri sono anche di sola lettura.

source: Motor #2 that is used to apply mechanical load is set to lower current (e.g., 50% of nominal current of motor #1).
it_it: Il motore #2, utilizzato per applicare il carico meccanico, è impostato su una corrente inferiore (ad esempio, il 50% della corrente nominale del motore #1).

source: Motor does not lose steps in overload conditions
it_it: Il motore non perde passi in condizioni di sovraccarico

source: Motor is running right now at 53687 ppt.
it_it: Il motore sta girando in questo momento a 53687 ppt.

source: Motors with a high detent torque show an increased variation of the StallGuard2 measurement value SG_RESULT with varying motor currents, especially at low currents.
it_it: I motori con elevata coppia di arresto mostrano una maggiore variazione del valore di misurazione di StallGuard2 SG_RESULT al variare delle correnti del motore, soprattutto a basse correnti.

source: Motors working over a wide temperature range may require temperature correction, because motor coil resistance increases with rising temperature.
it_it: I motori che funzionano in un ampio intervallo di temperatura potrebbero richiedere una correzione della temperatura, poiché la resistenza della bobina del motore aumenta con l'aumentare della temperatura.

source: Mounting Procedure of Mechanical Coupling of Two Stepper Motors
it_it: Procedura di Montaggio per l'Accoppiamento Meccanico di due Motori Passo-Passo

source: Moving and Controlling the Motor
it_it: Movimento e controllo del motore

source: Multipacketing, Option 1
it_it: Multipacketing, Opzione 1

source: Multipacketing, Option 2
it_it: Multipacketing, Opzione 2

source: Multipacketing, Option 3
it_it: Multipacketing, Opzione 3

source: Must be honored by decoder.
it_it: Deve essere rispettato dal decoder.

source: Name
it_it: Nome

source: Negative acknowledgment of received packet.
it_it: Conferma negativa del pacchetto ricevuto.

source: Nevertheless, the dependency needs to be evaluated for a given type of stepper motor and one need to define limits where StallGuard2 can be used.
it_it: Tuttavia, la dipendenza deve essere valutata per un dato tipo di motore passo-passo ed è necessario definire i limiti in cui è possibile utilizzare StallGuard2.

source: Nevertheless, when increasing velocity beyond the point where the current in the motor no longer reaches the chopping current due to the Back-EMF the StallGuard2 value SG will decrease again.
it_it: Tuttavia, aumentando la velocità oltre il punto in cui la corrente nel motore non raggiunge più la corrente di chopping a causa della forza controelettromotrice (Back-EMF), il valore SG di StallGuard2 diminuirà nuovamente.

source: New status information becomes latched at the end of each access and is available with the next SPI transfer.
it_it: Le nuove informazioni di stato vengono bloccate al termine di ogni accesso e sono disponibili con il successivo trasferimento SPI.

source: No ACK/NAK handshaking occurs even though it is enabled because data is unpacketed.
it_it: Non si verifica alcun handshake ACK/NAK anche se abilitato, perché i dati non sono pacchettizzati.

source: No baud rate configuration is required.
it_it: Non è richiesta alcuna configurazione della velocità di trasmissione.

source: No response is expected from the host since ACK/NAK handshaking is disabled.
it_it: Non è prevista alcuna risposta dall'host poiché l'handshake ACK/NAK è disabilitato.

source: No-noise, high-precision chopper algorithm for inaudible motion and inaudible standstill of the motor.
it_it: Algoritmo chopper silenzioso e ad alta precisione per un movimento e un arresto del motore impercettibili.

source: None
it_it: Nessuna

source: Notational Conventions
it_it: Convenzioni sulla Notazione

source: Note
it_it: Nota:

source: Note that because these NAKs are unexpected, interruption of transmission must occur first.
it_it: Si noti che, poiché questi NAK sono inaspettati, è necessario che la trasmissione venga interrotta prima.

source: Note that once the decoder gathers the appropriate data, it sends this data unsolicited.
it_it: Si noti che una volta che il decoder ha raccolto i dati appropriati, li invia spontaneamente.

source: Note that the length field in the header does NOT include the length of the checksum, but DOES include the length of the header itself.
it_it: Si noti che il campo "length " nell'intestazione NON include la lunghezza del checksum, ma include la lunghezza dell'intestazione stessa.

source: Note: D = Decoder, H = Host, H/D = Host/Decoder
it_it: Nota: D = Decoder, H = Host, H/D = Host/Decoder

source: Note: In order to understand where to find the parameters mentioned, and how to set them, please refer to the specific datasheet of your driver chip.
it_it: Nota: Per capire dove trovare i parametri menzionati e come impostarli, fare riferimento alla scheda tecnica specifica del chip driver.

source: Note: The checksum is a 2 byte checksum and must be sent as HIGH BYTE followed by LOW BYTE.
it_it: Nota: il checksum è un checksum a 2 byte e deve essere inviato come HIGH BYTE seguito da LOW BYTE.

source: Now I am trying to put a mechanical load.
it_it: Ora sto provando a applicare un carico meccanico.

source: Now enable sg_stop and make sure, that the motor is safely stopped whenever it is stalled.
it_it: Ora abilitare sg_stop e assicurarsi che il motore venga arrestato in sicurezza ogni volta che va in stallo.

source: Now here you can see the motor stops as the motor cut goes to 0.
it_it: Qui potete vedere che il motore si ferma quando il suo interruttore va a 0.

source: Now if I simulate a high mechanical load by trying to stop the motor by hand, the stall guard feature comes into play and the motor will stop.
it_it: Ora, se simulo un carico meccanico elevato provando ad arrestare manualmente il motore, la funzione di stall guard entra in gioco e il motore si arresta.

source: Now in order to set the cool step install guard, we have to click on the cool step install guard setting options under motor 1.
it_it: Ora, per impostare la protezione di installazione a freddo, dobbiamo cliccare sulle opzioni di impostazione della protezione di installazione a freddo sotto il motore 1.

source: Now increase SGT starting from 0 to a value, where SG_RESULT starts rising.
it_it: Ora aumentare SGT partendo da 0 fino a un valore in cui SG_RESULT inizia a salire.

source: Now the SGT value is set as sensibly as possible.
it_it: Ora il valore SGT è impostato nel modo più sensato possibile.

source: Now we click on the play button and motor will start running.
it_it: Ora clicchiamo sul pulsante di riproduzione e il motore inizierà a funzionare.

source: Now we close the motion calculator and enter 53687 as the target velocity.
it_it: Ora chiudiamo il calcolatore di movimento e inseriamo 53687 come velocità target.

source: Now we close the velocity mode window.
it_it: Chiudiamo la finestra della modalità velocità.

source: Now we set the cool step feature by clicking on the cool step just beside the stall guard.
it_it: Impostiamo la funzione di fase di raffreddamento cliccando sulla fase di raffreddamento, proprio accanto alla protezione dallo stallo.

source: Now we will click on the reset stall and motor will start moving again.
it_it: Ora clicchiamo su "Reset stall" e il motore riprenderà a muoversi.

source: Now we will set the motor current by clicking on the current setting.
it_it: Ora imposteremo la corrente del motore cliccando sull'impostazione corrente.
